tutorials/turbine/KrogstadWindTunnelCase/constant/airfoilProperties/NREL_S826_RE75k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d

//OLD stuff
(	-180	0.06071417	0.144935804	)
(	-175	0.683149354	0.223494484	)
(	-170	0.928282469	0.347798399	)
(	-165	0.876270897	0.474706056	)
(	-160	0.86638623	0.625519981	)
(	-155	0.932875429	0.801019306	)
(	-150	0.965101832	0.968482989	)
(	-145	1.065080328	1.223262604	)
(	-140	1.033453269	1.380786017	)
(	-135	0.99045269	1.550840714	)
(	-130	1.010102237	1.8461881	)
(	-125	0.921449778	2.014625072	)
(	-120	0.876373732	2.3099946	)
(	-115	0.70719892	2.381675796	)
(	-110	0.579517763	2.571831823	)
(	-105	0.462316413	2.944685439	)
(	-100	0.218925014	2.712260366	)
(	-95	0.027345624	2.653372613	)
(	-90	-0.157828368	2.651386307	)
(	-85	-0.332434523	2.621073481	)
(	-80	-0.518367271	2.659001736	)
(	-75	-0.684962546	2.576263452	)
(	-70	-0.832539981	2.449826422	)
(	-65	-0.949149778	2.288297396	)
(	-60	-1.106781022	2.291931148	)
(	-55	-1.089470183	1.913289952	)

//New values RE = 75000

(	-50	-0.5613	0.4253	)
(	-45	-0.5714	0.40606	)
(	-40	-0.5678	0.38617	)
(	-35	-0.5602	0.36973	)
(	-30	-0.5922	0.36749	)
(	-25	-0.5903	0.30369	)
(	-24	-0.5714	0.2887	)
(	-23	-0.5512	0.27431	)
(	-22	-0.5301	0.2603	)
(	-21	-0.5083	0.24673	)
(	-20	-0.4863	0.23345	)
(	-19	-0.4682	0.22278	)
(	-18	-0.444	0.20794	)
(	-17	-0.4248	0.19675	)
(	-16	-0.406	0.18565	)
(	-15	-0.3883	0.17289	)
(	-14	-0.3732	0.15978	)
(	-13	-0.3613	0.14667	)
(	-12	-0.3534	0.13355	)
(	-11	-0.3527	0.11971	)
(	-10	-0.3627	0.10485	)
(	-9	-0.372	0.08496	)
(	-8	-0.3927	0.06064	)
(	-7	-0.3566	0.0424	)
(	-6	-0.2558	0.03147	)
(	-5	-0.1505	0.02685	)
(	-4	-0.0075	0.02189	)
(	-3	0.1433	0.02043	)
(	-2	0.2817	0.02004	)
(	-1	0.416	0.01951	)
(	0	0.5366	0.01947	)
(	1	0.6566	0.0197	)
(	2	0.7691	0.02029	)
(	3	0.8922	0.02093	)
(	4	0.992	0.02199	)
(	5	1.1014	0.02285	)
(	6	1.1896	0.02388	)
(	7	1.255	0.0254	)
(	8	1.2857	0.02865	)
(	9	1.2853	0.03543	)
(	10	1.2899	0.04334	)
(	11	1.2922	0.05218	)
(	12	1.302	0.06275	)
(	13	1.3053	0.0752	)
(	14	1.3059	0.0889	)
(	15	1.2906	0.1058	)
(	16	1.2672	0.12541	)
(	17	1.2252	0.15387	)
(	18	1.1481	0.20387	)
(	19	1.1166	0.24488	)
(	20	1.1065	0.27574	)
(	21	1.0836	0.3069	)
(	22	1.008	0.31308	)
(	23	0.9319	0.31926	)
(	24	0.9134	0.32715	)
(	25	0.889	0.32599	)
(	30	0.8604	0.34936	)
(	35	0.8482	0.3996	)
(	40	0.8247	0.43515	)
(	45	0.7959	0.47329	)
(	50	0.7461	0.5045	)


//OLD stuff
(	55	1.60097269	2.320797107	)
(	60	1.418212498	2.450651302	)
(	65	1.240684494	2.595659402	)
(	70	1.039209894	2.722961427	)
(	75	0.838773462	2.906541755	)
(	80	0.598364995	2.952011765	)
(	85	0.358578033	3.137988235	)
(	90	0.090599634	3.337229315	)
(	95	-0.150555823	2.936015815	)
(	100	-0.448594735	3.194177435	)
(	105	-0.742829431	3.259712247	)
(	110	-0.978080791	3.062044166	)
(	115	-1.164313095	2.806026422	)
(	120	-1.327900386	2.563311475	)
(	125	-1.467913462	2.324761813	)
(	130	-1.502751148	1.991975892	)
(	135	-1.527525882	1.699897281	)
(	140	-1.557622122	1.459593616	)
(	145	-1.47193379	1.159616991	)
(	150	-1.45242162	0.947607425	)
(	155	-1.298914966	0.6945135	)
(	160	-1.364641099	0.535981485	)
(	165	-1.426565072	0.35643946	)
(	170	-0.973898245	0.198538573	)
(	175	-0.442199653	0.130726854	)
(	180	0.058547898	0.139764517	)

);
