tutorials/turbine/KrogstadWindTunnelCase/constant/turbineProperties/NORCOWEBTest
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

NumBl                   3;
TipRad                  0.447;
HubRad                  0.045;
UndSling                0.0;
OverHang              -0.13;
TowerHt                 0.772;
Twr2Shft                0.045;
ShftTilt                0.0;
PreCone               (0 0 0);
GBRatio                 1.0;
RatedRotSpeed        2378.0;
GenIner                 1.0;
HubIner                 1.0;
BladeIner               1.0;
GenTorqueControllerType     "none";
NacYawControllerType        "none";
BladePitchControllerType    "none";
RotSpeedLimiter             false;
GenTorqueRateLimiter        true;
NacYawRateLimiter           true;
BladePitchRateLimiter       true;
SpeedFilterCornerFrequency  2.0;


GenTorqueControllerParams
{
    RateLimitGenTorque   1.0;
}

BladePitchControllerParams
{
    RateLimitBladePitch  1.0;
}

NacYawControllerParams
{
    RateLimitNacYaw      1.0;
}


Airfoils
(
    "Cylinder2"
    "NREL_S826_RE75k"
    "NREL_S826_RE100k"
    "NREL_S826_RE150k"

);

BladeData
(
//  radius(m)   c(m)     twist(deg) airfoil
   ( 0.0075000 0.013500 38.000 0)
   ( 0.022500 0.013500 38.000 0)
   ( 0.049000 0.013500 38.000 0)
   ( 0.055000 0.049500 38.000 1)
   ( 0.067500 0.081433 37.055 2)
   ( 0.082500 0.080111 32.544 2)
   ( 0.097500 0.077012 28.677 3)
   ( 0.11250 0.073126 25.262 3)
   ( 0.12750 0.069008 22.430 3)
   ( 0.14250 0.064952 19.988 3)
   ( 0.15750 0.061102 18.034 3)
   ( 0.17250 0.057520 16.349 3)
   ( 0.18750 0.054223 14.663 3)
   ( 0.20250 0.051204 13.067 3)
   ( 0.21750 0.048447 11.829 3)
   ( 0.23250 0.045931 10.753 3)
   ( 0.24750 0.043632 9.8177 3)
   ( 0.26250 0.041529 8.8827 3)
   ( 0.27750 0.039601 7.9877 3)
   ( 0.29250 0.037831 7.2527 3)
   ( 0.30750 0.036201 6.5650 3)
   ( 0.32250 0.034697 5.9187 3)
   ( 0.33750 0.033306 5.3045 3)
   ( 0.35250 0.032017 4.7185 3)
   ( 0.36750 0.030819 4.1316 3)
   ( 0.38250 0.029704 3.5439 3)
   ( 0.39750 0.028664 2.9433 3)
   ( 0.41250 0.027691 2.2185 3)
   ( 0.42750 0.026780 1.0970 3)
   ( 0.44250 0.025926 -0.7167 3)
);
