tutorials/turbine/KrogstadWindTunnelCase/constant/turbineProperties/TowerModel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

NumBl                   1;
TipRad                  0.817;
HubRad                  0.001;
PSpnElN                 1.0;
UndSling                0.0;
HubCM                   0.0;
OverHang              -0.13;
NacCMxn                 0.1;
NacCMyn                 0.0;
NacCMzn                 0.045;
TowerHt                 0.001;
Twr2Shft                0.045;
TwrRBHt                 0.0;
ShftTilt                0.0;
Delta3                  0.0;
PreCone               (0 0 0);
AzimB1Up                0.0;
HubIner               100.0;
YawRate                 0.0;
PitchRate               0.0;
SpeedControllerType    "none";
YawControllerType      "none";

//Added
GBRatio			1;
GenIner			1;
BladeIner		1;
TorqueControllerType	"none";
PitchControllerType	"none";

TorqueControllerParams
{
    CutInGenSpeed           670.0;
    RatedGenSpeed          1173.7;
    Region2StartGenSpeed    871.0;
    Region2EndGenSpeed     1161.963;
    CutInGenTorque            0.0;
    RatedGenTorque           43.09355E3;
    RateLimitGenTorque       15.0E3;
    KGen                      2.55764E-2;
    TorqueControllerRelax     1.0;
}

PitchControllerParams
{
    PitchControlStartPitch    0.0;
    PitchControlEndPitch      7.6;
    PitchControlStartSpeed    15.77;
    PitchControlEndSpeed      16.0;
    RateLimitPitch             4.5;
}

//End Added

Airfoils
(
    "Cylinder2"
    "S826_re39000"
//    "S826_re78000"
//    "S826_re93000"
//    "S826_re101400"
//    "NREL_S826_newshort"
//    "NREL_S826_new"
//    "NREL_S826"
//    "NACA64_A17"
);

BladeData
(
//  radius(m)   c(m)     twist(deg) airfoil
   //( 0.001 0.102 38.000 0)
   ( 0.001 0.102 38 0)
   ( 0.177 0.102 38 0)
   ( 0.178 0.082 38 0)
   ( 0.416 0.082 38 0)
   ( 0.417 0.061 38 0)
   ( 0.576 0.061 38 0)
   ( 0.577 0.051 38 0)
   ( 0.817 0.051 38 0)
   ( 0.818 0.001 38 1)
);
