tutorials/turbine/KrogstadWindTunnelCase/0.original/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    ground
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    walls
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    inflow
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    outflow
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
